backend: !!python/unicode 'tensorflow'
class_name: Sequential
config:
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    batch_input_shape: !!python/tuple [null, 18]
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    dtype: float32
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_1
    trainable: true
    units: 18
    use_bias: true
- class_name: Dropout
  config: {name: dropout_1, rate: 0.3, trainable: true}
- class_name: Dense
  config:
    activation: relu
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_2
    trainable: true
    units: 9
    use_bias: true
- class_name: Dropout
  config: {name: dropout_2, rate: 0.2, trainable: true}
- class_name: Dense
  config:
    activation: sigmoid
    activity_regularizer: null
    bias_constraint: null
    bias_initializer:
      class_name: Zeros
      config: {}
    bias_regularizer: null
    kernel_constraint: null
    kernel_initializer:
      class_name: RandomNormal
      config: {mean: 0.0, seed: null, stddev: 0.05}
    kernel_regularizer: null
    name: dense_3
    trainable: true
    units: 1
    use_bias: true
keras_version: 2.0.6
